package archandpattern.shedule.controller;

public class A_HomeWork8 {

    public static void main(String[] args) {
        /*
        Дмитрий, добрый день!
        Проанализировав мою работу на курсе, я нашел один главный антипаттерн (не считая не главных:).
        Это AssInSoap (простите мой французский).
        Из-за этого антипаттерна я получил несколько плохих оценок и хорошую работу. :)

        Тем не менее, ваш курс оказался мне полезным не только в теории, но и на практике.
        Паттерн "Фасад" мне помог предложить решение, пусть и в малозначительном направлении (к многозначительным я
        пока не имею допуска:), но он уже пригодился.
        Благодаря этому - на дополнительное обучение я иду уже с 21 декабря, а не спустя три месяца испытательного срока.
        Спасибо за переданный опыт!

        P.S.: Есть и небольшие пожелания. Правда они больше исходят от человека, который спал в день 4-5 часов.
        Лекция проходит на одной ноте, что требует от лектора большой выдержки, а от студента.. А вот тоже большой выдержки.
        Я не был лектором, поэтому не могу подсказать пути решения, но это единственное, с чем я столкнулся.

        И еще раз спасибо за то, что делитесь своим опытом!
         */
    }
}